{"format": "layers-model", "generatedBy": "keras v2.0.5", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.0.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "filters": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_1", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "filters": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_2", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_1", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_1", "trainable": true, "filters": 8, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_4", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_2", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_2", "trainable": true, "filters": 8, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_5", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "trainable": true, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "same", "pool_size": [3, 3], "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_3", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_3", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_3", "trainable": true, "filters": 16, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_7", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_4", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_4", "trainable": true, "filters": 16, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_8", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null, "trainable": true, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "same", "pool_size": [3, 3], "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_6", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_5", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_5", "trainable": true, "filters": 32, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_10", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_6", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_6", "trainable": true, "filters": 32, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_11", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_regularizer": null, "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "padding": "same", "pool_size": [3, 3], "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_9", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_7", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_7", "trainable": true, "filters": 64, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_13", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_8", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "name": "separable_conv2d_8", "trainable": true, "filters": 64, "pointwise_constraint": null, "padding": "same", "activation": "linear", "bias_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_14", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_regularizer": null, "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true, "padding": "same", "pool_size": [3, 3], "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "name": "batch_normalization_12", "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_7", "kernel_regularizer": null, "trainable": true, "filters": 7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "predictions", "config": {"activation": "softmax", "name": "predictions", "trainable": true}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}], "output_layers": [["predictions", 0, 0]], "name": "model_1"}}, "training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 1, 5], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 5, 5], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [1, 1, 5, 8], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 7], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [7], "dtype": "float32"}, {"name": "separable_conv2d_1/depthwise_kernel", "shape": [3, 3, 5, 1], "dtype": "float32"}, {"name": "separable_conv2d_1/pointwise_kernel", "shape": [1, 1, 5, 8], "dtype": "float32"}, {"name": "separable_conv2d_2/depthwise_kernel", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "separable_conv2d_2/pointwise_kernel", "shape": [1, 1, 8, 8], "dtype": "float32"}, {"name": "separable_conv2d_3/depthwise_kernel", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "separable_conv2d_3/pointwise_kernel", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "separable_conv2d_4/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "separable_conv2d_4/pointwise_kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "separable_conv2d_5/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "separable_conv2d_5/pointwise_kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "separable_conv2d_6/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "separable_conv2d_6/pointwise_kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "separable_conv2d_7/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "separable_conv2d_7/pointwise_kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "separable_conv2d_8/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "separable_conv2d_8/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}]}]}