{"format": "layers-model", "generatedBy": "keras v2.1.5", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["reshape_2", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 48, 48, 1], "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_1"}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_3"}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_5"}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_1", "gamma_constraint": null}, "name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_4", "gamma_constraint": null}, "name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_7", "gamma_constraint": null}, "name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_1"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_3"}, "name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_5"}, "name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_1"}, "name": "depthwise_conv2d_1", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [13, 13], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_2"}, "name": "depthwise_conv2d_2", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [21, 21], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_3"}, "name": "depthwise_conv2d_3", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_2", "gamma_constraint": null}, "name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_5", "gamma_constraint": null}, "name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_8", "gamma_constraint": null}, "name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_2"}, "name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_4"}, "name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_6"}, "name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_2"}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_4"}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_6"}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_3", "gamma_constraint": null}, "name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_6", "gamma_constraint": null}, "name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_9", "gamma_constraint": null}, "name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}], ["batch_normalization_6", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_7"}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_10", "gamma_constraint": null}, "name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_7"}, "name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_4"}, "name": "depthwise_conv2d_4", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_11", "gamma_constraint": null}, "name": "batch_normalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_8"}, "name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_8"}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_12", "gamma_constraint": null}, "name": "batch_normalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 192, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_9"}, "name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_13", "gamma_constraint": null}, "name": "batch_normalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_9"}, "name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_5"}, "name": "depthwise_conv2d_5", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_14", "gamma_constraint": null}, "name": "batch_normalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_10"}, "name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_10"}, "name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_15", "gamma_constraint": null}, "name": "batch_normalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_11"}, "name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_16", "gamma_constraint": null}, "name": "batch_normalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_11"}, "name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_6"}, "name": "depthwise_conv2d_6", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_17", "gamma_constraint": null}, "name": "batch_normalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_12"}, "name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_12"}, "name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_18", "gamma_constraint": null}, "name": "batch_normalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "name": "add_1", "class_name": "Add", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_13"}, "name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_19", "gamma_constraint": null}, "name": "batch_normalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_13"}, "name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_7"}, "name": "depthwise_conv2d_7", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_20", "gamma_constraint": null}, "name": "batch_normalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_7", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_14"}, "name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_14"}, "name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_21", "gamma_constraint": null}, "name": "batch_normalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_2"}, "name": "add_2", "class_name": "Add", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_15"}, "name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_22", "gamma_constraint": null}, "name": "batch_normalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_15"}, "name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_8"}, "name": "depthwise_conv2d_8", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_23", "gamma_constraint": null}, "name": "batch_normalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_8", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_16"}, "name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_16"}, "name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_24", "gamma_constraint": null}, "name": "batch_normalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 576, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_17"}, "name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_25", "gamma_constraint": null}, "name": "batch_normalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_17"}, "name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_9"}, "name": "depthwise_conv2d_9", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_26", "gamma_constraint": null}, "name": "batch_normalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_9", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_18"}, "name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_18"}, "name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_27", "gamma_constraint": null}, "name": "batch_normalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_3"}, "name": "add_3", "class_name": "Add", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_24", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 576, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_19"}, "name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_28", "gamma_constraint": null}, "name": "batch_normalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_19"}, "name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_10"}, "name": "depthwise_conv2d_10", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_29", "gamma_constraint": null}, "name": "batch_normalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_10", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_20"}, "name": "activation_20", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_20"}, "name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_30", "gamma_constraint": null}, "name": "batch_normalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_4"}, "name": "add_4", "class_name": "Add", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 576, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_21"}, "name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_31", "gamma_constraint": null}, "name": "batch_normalization_31", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_21"}, "name": "activation_21", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]]}, {"config": {"trainable": true, "depthwise_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "depthwise_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "depthwise_conv2d_11"}, "name": "depthwise_conv2d_11", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_32", "gamma_constraint": null}, "name": "batch_normalization_32", "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_11", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_22"}, "name": "activation_22", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_22"}, "name": "conv2d_22", "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_33", "gamma_constraint": null}, "name": "batch_normalization_33", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_5"}, "name": "add_5", "class_name": "Add", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"config": {"trainable": true, "filters": 576, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_23"}, "name": "conv2d_23", "class_name": "Conv2D", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "gamma_regularizer": null, "name": "batch_normalization_34", "gamma_constraint": null}, "name": "batch_normalization_34", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu6", "name": "activation_23"}, "name": "activation_23", "class_name": "Activation", 